*Exercise 1.21:* Use the `smallest-divisor' procedure to find the
smallest divisor of each of the following numbers: 199, 1999,
19999.

#+begin_src scheme :results list
  (define (divides? a b)
    (= (modulo b a) 0))

  (define (find-divisor n test-divisor)
    (cond ((> (sqr test-divisor) n) n)
          ((divides? test-divisor n) test-divisor)
          (else (find-divisor n (+ test-divisor 1)))))

  (define (smallest-divisor n)
    (find-divisor n 2))

  (list
   (smallest-divisor 199)
   (smallest-divisor 1999)
   (smallest-divisor 19999))
#+end_src

#+RESULTS:
- 199
- 1999
- 7
